Masmiseim36/iMXRT/targets/iMXRT/devices/iMXRT1150/periph/PERI_CCM_OBS.h
/* The count of CCM_OBS_OBSERVE_CONTROL_TOG */
#define CCM_OBS_OBSERVE_CONTROL_TOG_COUNT        (6U)

/*! @name OBSERVE_STATUS0 - Observe status */
/*! @{ */

#define CCM_OBS_OBSERVE_STATUS0_SELECT_MASK      (0x1FFU)
#define CCM_OBS_OBSERVE_STATUS0_SELECT_SHIFT     (0U)
/*! SELECT - Select value */
#define CCM_OBS_OBSERVE_STATUS0_SELECT(x)        (((uint32_t)(((uint32_t)(x)) << CCM_OBS_OBSERVE_STATUS0_SELECT_SHIFT)) & CCM_OBS_OBSERVE_STATUS0_SELECT_MASK)

#define CCM_OBS_OBSERVE_STATUS0_RAW_MASK         (0x1000U)
#define CCM_OBS_OBSERVE_STATUS0_RAW_SHIFT        (12U)
/*! RAW - Observe raw signal
 *  0b0..Divided signal is selected
 *  0b1..Raw signal is selected
 */
#define CCM_OBS_OBSERVE_STATUS0_RAW(x)           (((uint32_t)(((uint32_t)(x)) << CCM_OBS_OBSERVE_STATUS0_RAW_SHIFT)) & CCM_OBS_OBSERVE_STATUS0_RAW_MASK)

#define CCM_OBS_OBSERVE_STATUS0_INV_MASK         (0x2000U)
#define CCM_OBS_OBSERVE_STATUS0_INV_SHIFT        (13U)
/*! INV - Polarity of the observe target
 *  0b0..Polarity is not inverted
 *  0b1..Polarity of the observe target is inverted
 */
#define CCM_OBS_OBSERVE_STATUS0_INV(x)           (((uint32_t)(((uint32_t)(x)) << CCM_OBS_OBSERVE_STATUS0_INV_SHIFT)) & CCM_OBS_OBSERVE_STATUS0_INV_MASK)

#define CCM_OBS_OBSERVE_STATUS0_RESET_MASK       (0x8000U)
#define CCM_OBS_OBSERVE_STATUS0_RESET_SHIFT      (15U)
/*! RESET - Reset state
 *  0b0..Observe divider is not in reset state
 *  0b1..Observe divider is in reset state
 */
#define CCM_OBS_OBSERVE_STATUS0_RESET(x)         (((uint32_t)(((uint32_t)(x)) << CCM_OBS_OBSERVE_STATUS0_RESET_SHIFT)) & CCM_OBS_OBSERVE_STATUS0_RESET_MASK)

#define CCM_OBS_OBSERVE_STATUS0_DIVIDE_MASK      (0xFF0000U)
#define CCM_OBS_OBSERVE_STATUS0_DIVIDE_SHIFT     (16U)
/*! DIVIDE - Divide value status. The clock will be divided by DIVIDE + 1. */
#define CCM_OBS_OBSERVE_STATUS0_DIVIDE(x)        (((uint32_t)(((uint32_t)(x)) << CCM_OBS_OBSERVE_STATUS0_DIVIDE_SHIFT)) & CCM_OBS_OBSERVE_STATUS0_DIVIDE_MASK)

#define CCM_OBS_OBSERVE_STATUS0_OFF_MASK         (0x1000000U)
#define CCM_OBS_OBSERVE_STATUS0_OFF_SHIFT        (24U)
/*! OFF - Turn off slice
 *  0b0..observe slice is on
 *  0b1..observe slice is off
 */
#define CCM_OBS_OBSERVE_STATUS0_OFF(x)           (((uint32_t)(((uint32_t)(x)) << CCM_OBS_OBSERVE_STATUS0_OFF_SHIFT)) & CCM_OBS_OBSERVE_STATUS0_OFF_MASK)
/*! @} */

/* The count of CCM_OBS_OBSERVE_STATUS0 */
#define CCM_OBS_OBSERVE_STATUS0_COUNT            (6U)

/*! @name OBSERVE_AUTHEN - Observe access control */
/*! @{ */

#define CCM_OBS_OBSERVE_AUTHEN_TZ_USER_MASK      (0x1U)
#define CCM_OBS_OBSERVE_AUTHEN_TZ_USER_SHIFT     (0U)
/*! TZ_USER - User access
 *  0b0..Clock cannot be changed in user mode.
 *  0b1..Clock can be changed in user mode.
 */
#define CCM_OBS_OBSERVE_AUTHEN_TZ_USER(x)        (((uint32_t)(((uint32_t)(x)) << CCM_OBS_OBSERVE_AUTHEN_TZ_USER_SHIFT)) & CCM_OBS_OBSERVE_AUTHEN_TZ_USER_MASK)

#define CCM_OBS_OBSERVE_AUTHEN_TZ_NS_MASK        (0x2U)
#define CCM_OBS_OBSERVE_AUTHEN_TZ_NS_SHIFT       (1U)
/*! TZ_NS - Non-secure access
 *  0b0..Cannot be changed in Non-secure mode.
 *  0b1..Can be changed in Non-secure mode.
 */
#define CCM_OBS_OBSERVE_AUTHEN_TZ_NS(x)          (((uint32_t)(((uint32_t)(x)) << CCM_OBS_OBSERVE_AUTHEN_TZ_NS_SHIFT)) & CCM_OBS_OBSERVE_AUTHEN_TZ_NS_MASK)

#define CCM_OBS_OBSERVE_AUTHEN_LOCK_TZ_MASK      (0x10U)
#define CCM_OBS_OBSERVE_AUTHEN_LOCK_TZ_SHIFT     (4U)
/*! LOCK_TZ - Lock TZ_USER and TZ_NS
 *  0b0..Not locked.
 *  0b1..Locked.
 */
#define CCM_OBS_OBSERVE_AUTHEN_LOCK_TZ(x)        (((uint32_t)(((uint32_t)(x)) << CCM_OBS_OBSERVE_AUTHEN_LOCK_TZ_SHIFT)) & CCM_OBS_OBSERVE_AUTHEN_LOCK_TZ_MASK)

#define CCM_OBS_OBSERVE_AUTHEN_WHITE_LIST_MASK   (0xF00U)
#define CCM_OBS_OBSERVE_AUTHEN_WHITE_LIST_SHIFT  (8U)
/*! WHITE_LIST - White list
 *  0b0000..No domain can change.
 *  0b0001..Domain 0 can change.
 *  0b0010..Domain 1 can change.
 *  0b0011..Domain 0 and domain 1 can change.
 *  0b0100..Domain 2 can change.
 *  0b1111..All domain can change.
 */
#define CCM_OBS_OBSERVE_AUTHEN_WHITE_LIST(x)     (((uint32_t)(((uint32_t)(x)) << CCM_OBS_OBSERVE_AUTHEN_WHITE_LIST_SHIFT)) & CCM_OBS_OBSERVE_AUTHEN_WHITE_LIST_MASK)

#define CCM_OBS_OBSERVE_AUTHEN_LOCK_LIST_MASK    (0x1000U)
#define CCM_OBS_OBSERVE_AUTHEN_LOCK_LIST_SHIFT   (12U)
/*! LOCK_LIST - Lock white list
 *  0b0..White list is not locked.
 *  0b1..White list is locked.
 */
#define CCM_OBS_OBSERVE_AUTHEN_LOCK_LIST(x)      (((uint32_t)(((uint32_t)(x)) << CCM_OBS_OBSERVE_AUTHEN_LOCK_LIST_SHIFT)) & CCM_OBS_OBSERVE_AUTHEN_LOCK_LIST_MASK)

#define CCM_OBS_OBSERVE_AUTHEN_DOMAIN_MODE_MASK  (0x10000U)
#define CCM_OBS_OBSERVE_AUTHEN_DOMAIN_MODE_SHIFT (16U)
/*! DOMAIN_MODE - Low power and access control by domain
 *  0b0..Clock does not work in domain mode.
 *  0b1..Clock works in domain mode.
 */
#define CCM_OBS_OBSERVE_AUTHEN_DOMAIN_MODE(x)    (((uint32_t)(((uint32_t)(x)) << CCM_OBS_OBSERVE_AUTHEN_DOMAIN_MODE_SHIFT)) & CCM_OBS_OBSERVE_AUTHEN_DOMAIN_MODE_MASK)

#define CCM_OBS_OBSERVE_AUTHEN_LOCK_MODE_MASK    (0x100000U)
#define CCM_OBS_OBSERVE_AUTHEN_LOCK_MODE_SHIFT   (20U)
/*! LOCK_MODE - Lock low power and access mode
 *  0b0..MODE is not locked.
 *  0b1..MODE is locked.
 */
#define CCM_OBS_OBSERVE_AUTHEN_LOCK_MODE(x)      (((uint32_t)(((uint32_t)(x)) << CCM_OBS_OBSERVE_AUTHEN_LOCK_MODE_SHIFT)) & CCM_OBS_OBSERVE_AUTHEN_LOCK_MODE_MASK)
/*! @} */

/* The count of CCM_OBS_OBSERVE_AUTHEN */
#define CCM_OBS_OBSERVE_AUTHEN_COUNT             (6U)

/*! @name OBSERVE_AUTHEN_SET - Observe access control */
/*! @{ */

#define CCM_OBS_OBSERVE_AUTHEN_SET_TZ_USER_MASK  (0x1U)
#define CCM_OBS_OBSERVE_AUTHEN_SET_TZ_USER_SHIFT (0U)
/*! TZ_USER - User access */
#define CCM_OBS_OBSERVE_AUTHEN_SET_TZ_USER(x)    (((uint32_t)(((uint32_t)(x)) << CCM_OBS_OBSERVE_AUTHEN_SET_TZ_USER_SHIFT)) & CCM_OBS_OBSERVE_AUTHEN_SET_TZ_USER_MASK)

#define CCM_OBS_OBSERVE_AUTHEN_SET_TZ_NS_MASK    (0x2U)
#define CCM_OBS_OBSERVE_AUTHEN_SET_TZ_NS_SHIFT   (1U)
/*! TZ_NS - Non-secure access */
#define CCM_OBS_OBSERVE_AUTHEN_SET_TZ_NS(x)      (((uint32_t)(((uint32_t)(x)) << CCM_OBS_OBSERVE_AUTHEN_SET_TZ_NS_SHIFT)) & CCM_OBS_OBSERVE_AUTHEN_SET_TZ_NS_MASK)

#define CCM_OBS_OBSERVE_AUTHEN_SET_LOCK_TZ_MASK  (0x10U)
#define CCM_OBS_OBSERVE_AUTHEN_SET_LOCK_TZ_SHIFT (4U)
/*! LOCK_TZ - Lock TZ_USER and TZ_NS */
#define CCM_OBS_OBSERVE_AUTHEN_SET_LOCK_TZ(x)    (((uint32_t)(((uint32_t)(x)) << CCM_OBS_OBSERVE_AUTHEN_SET_LOCK_TZ_SHIFT)) & CCM_OBS_OBSERVE_AUTHEN_SET_LOCK_TZ_MASK)

#define CCM_OBS_OBSERVE_AUTHEN_SET_WHITE_LIST_MASK (0xF00U)
#define CCM_OBS_OBSERVE_AUTHEN_SET_WHITE_LIST_SHIFT (8U)
/*! WHITE_LIST - White list */
#define CCM_OBS_OBSERVE_AUTHEN_SET_WHITE_LIST(x) (((uint32_t)(((uint32_t)(x)) << CCM_OBS_OBSERVE_AUTHEN_SET_WHITE_LIST_SHIFT)) & CCM_OBS_OBSERVE_AUTHEN_SET_WHITE_LIST_MASK)

#define CCM_OBS_OBSERVE_AUTHEN_SET_LOCK_LIST_MASK (0x1000U)
#define CCM_OBS_OBSERVE_AUTHEN_SET_LOCK_LIST_SHIFT (12U)
/*! LOCK_LIST - Lock white list */
#define CCM_OBS_OBSERVE_AUTHEN_SET_LOCK_LIST(x)  (((uint32_t)(((uint32_t)(x)) << CCM_OBS_OBSERVE_AUTHEN_SET_LOCK_LIST_SHIFT)) & CCM_OBS_OBSERVE_AUTHEN_SET_LOCK_LIST_MASK)

